Revit 2027 API
ParameterTypeId.DoorConstructionType Property
 "Construction Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DoorConstructionType { get; }
Public Shared ReadOnly Property DoorConstructionType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DoorConstructionType {
	ForgeTypeId^ get ();
}
static member DoorConstructionType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace